{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "dtype": "float32",
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "aerosol_cans",
    "1": "aluminum_food_cans",
    "2": "aluminum_soda_cans",
    "3": "cardboard_boxes",
    "4": "cardboard_packaging",
    "5": "clothing",
    "6": "coffee_grounds",
    "7": "disposable_plastic_cutlery",
    "8": "eggshells",
    "9": "food_waste",
    "10": "glass_beverage_bottles",
    "11": "glass_cosmetic_containers",
    "12": "glass_food_jars",
    "13": "magazines",
    "14": "newspaper",
    "15": "office_paper",
    "16": "paper_cups",
    "17": "plastic_cup_lids",
    "18": "plastic_detergent_bottles",
    "19": "plastic_food_containers",
    "20": "plastic_shopping_bags",
    "21": "plastic_soda_bottles",
    "22": "plastic_straws",
    "23": "plastic_trash_bags",
    "24": "plastic_water_bottles",
    "25": "shoes",
    "26": "steel_food_cans",
    "27": "styrofoam_cups",
    "28": "styrofoam_food_containers",
    "29": "tea_bags"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "aerosol_cans": 0,
    "aluminum_food_cans": 1,
    "aluminum_soda_cans": 2,
    "cardboard_boxes": 3,
    "cardboard_packaging": 4,
    "clothing": 5,
    "coffee_grounds": 6,
    "disposable_plastic_cutlery": 7,
    "eggshells": 8,
    "food_waste": 9,
    "glass_beverage_bottles": 10,
    "glass_cosmetic_containers": 11,
    "glass_food_jars": 12,
    "magazines": 13,
    "newspaper": 14,
    "office_paper": 15,
    "paper_cups": 16,
    "plastic_cup_lids": 17,
    "plastic_detergent_bottles": 18,
    "plastic_food_containers": 19,
    "plastic_shopping_bags": 20,
    "plastic_soda_bottles": 21,
    "plastic_straws": 22,
    "plastic_trash_bags": 23,
    "plastic_water_bottles": 24,
    "shoes": 25,
    "steel_food_cans": 26,
    "styrofoam_cups": 27,
    "styrofoam_food_containers": 28,
    "tea_bags": 29
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "transformers_version": "4.57.5"
}
